mverch67/device-ui-project/variants/wt32-sc01-plus/pins_arduino.h
#ifndef Pins_Arduino_h
#define Pins_Arduino_h

#include <stdint.h>

#define USB_VID 0x303A
#define USB_PID 0x80D0
#define USB_MANUFACTURER "wireless-tag"
#define USB_PRODUCT "WT32-SC01 Plus"
#define USB_SERIAL ""

// #define EXTERNAL_NUM_INTERRUPTS 46
// #define NUM_DIGITAL_PINS        17
// #define NUM_ANALOG_INPUTS       9

// #define analogInputToDigitalPin(p)  (((p)<20)?(analogChannelToDigitalPin(p)):-1)
// #define digitalPinToInterrupt(p)    (((p)<48)?(p):-1)
// #define digitalPinHasPWM(p)         (p < 46)

static const uint8_t SPI_MOSI = 40;
static const uint8_t SPI_SCK = 39;
static const uint8_t SPI_MISO = 38;
static const uint8_t SPI_CS = 41;
static const uint8_t SDCARD_CS = SPI_CS;

static const uint8_t TX = 43;
static const uint8_t RX = 44;

static const uint8_t SDA = 8;
static const uint8_t SCL = 9;

static const uint8_t SS = 34;
static const uint8_t MOSI = 35;
static const uint8_t MISO = 37;
static const uint8_t SDO = 35;
static const uint8_t SDI = 37;
static const uint8_t SCK = 36;

static const uint8_t A0 = 1;
static const uint8_t A1 = 2;
static const uint8_t A2 = 3;
static const uint8_t A3 = 4;
static const uint8_t A4 = 5;
static const uint8_t A5 = 6;
static const uint8_t A6 = 7;
static const uint8_t A7 = 8;
static const uint8_t A8 = 9;

static const uint8_t T1 = 1;
static const uint8_t T2 = 2;
static const uint8_t T3 = 3;
static const uint8_t T4 = 4;
static const uint8_t T5 = 5;
static const uint8_t T6 = 6;
static const uint8_t T7 = 7;
static const uint8_t T8 = 8;
static const uint8_t T9 = 9;

static const uint8_t VBAT_SENSE = 10;
static const uint8_t VBUS_SENSE = 33;

static const uint8_t RGB_DATA = 18;
static const uint8_t RGB_PWR = 17;

#endif /* Pins_Arduino_h */
